tap "eth-p/software"
tap "homebrew/cask"
tap "homebrew/core"
tap "mongodb/brew"
tap "stripe/stripe-cli"
# Run your GitHub Actions locally
brew "act"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Matrix
brew "cmatrix"
# Modern, maintained replacement for ls
brew "eza"
# Open-source framework for augmenting humans using AI
brew "fabric-ai"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# GNU typing tutor
brew "gnu-typist"
# Mac App Store command-line interface
brew "mas"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Node version management
brew "n"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Find and verify credentials
brew "trufflehog"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Web browser focusing on privacy
cask "brave-browser"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "firefox"
# Screen colour temperature controller
cask "flux-app"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
# 3D parametric modeller
cask "freecad"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Open-source video transcoder
cask "handbrake-app"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Email client
cask "microsoft-outlook"
# Sandbox construction video game
cask "minecraft"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Free and open-source RSS reader
cask "netnewswire"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Cloud storage client
cask "onedrive"
# Programmable solid 3D CAD modeller
cask "openscad"
# Collaboration platform for API development
cask "postman"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Set up, configure, manage and analyze your UniFi network
cask "ubiquiti-unifi-controller"
# 3D printer and slicing GUI
cask "ultimaker-cura"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "webex"
# Connect to Windows
cask "windows-app"
# Network protocol analyzer
cask "wireshark-app"
mas "Discovery", id: 1381004916
mas "Flow", id: 1423210932
mas "HP", id: 1474276998
mas "iMovie", id: 408981434
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "uBlock Origin Lite", id: 6745342698
mas "WireGuard", id: 1451685025
vscode "bradlc.vscode-tailwindcss"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.remotehub"
vscode "jaspernorth.vscode-pigments"
vscode "johnpapa.vscode-peacock"
vscode "marlinfirmware.auto-build"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-repositories"
vscode "oderwat.indent-rainbow"
vscode "platformio.platformio-ide"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "skyran.js-jsx-snippets"
vscode "stivo.tailwind-fold"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tyriar.lorem-ipsum"
vscode "voldemortensen.rainbow-tags"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
